# 1699. Number of Calls Between Two Persons
[問題](https://leetcode.com/problems/number-of-calls-between-two-persons/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針

from_idとto_idのsetの列を追加して、それでグルーピングする。

In [2]:
import pandas as pd

In [119]:
data = [[1, 2, 59], [2, 1, 11], [1, 3, 20], [3, 4, 100], [3, 4, 200], [3, 4, 200], [4, 3, 499]]
calls = pd.DataFrame(data, columns=['from_id', 'to_id', 'duration']).astype({'from_id':'Int64', 'to_id':'Int64', 'duration':'Int64'})

In [120]:
calls

   from_id  to_id  duration
0        1      2        59
1        2      1        11
2        1      3        20
3        3      4       100
4        3      4       200
5        3      4       200
6        4      3       499

In [139]:
def number_of_calls(calls: pd.DataFrame) -> pd.DataFrame:
    calls["id_set"] = calls.apply(lambda row: tuple(sorted(list({row["from_id"], row["to_id"]}))), axis=1)
    grouped = calls.groupby("id_set")["duration"].sum().reset_index()
    grouped["call_count"] = calls.groupby("id_set").count().reset_index()["duration"]
    grouped["person1"] = grouped["id_set"].apply(lambda x: list(x)[0])
    grouped["person2"] = grouped["id_set"].apply(lambda x: list(x)[1])
    grouped = grouped.rename({"duration": "total_duration"}, axis=1)
    return grouped[["person1", "person2", "call_count", "total_duration"]]

In [140]:
number_of_calls(calls)

   person1  person2  call_count  total_duration
0        1        2           2              70
1        1        3           1              20
2        3        4           4             999

## Test scripts

In [141]:
# 一旦リストにして並び変えてから、タプルに変換する
calls["id_set"] = calls.apply(lambda row: tuple(sorted(list({row["from_id"], row["to_id"]}))), axis=1)

In [142]:
calls

   from_id  to_id  duration  id_set
0        1      2        59  (1, 2)
1        2      1        11  (1, 2)
2        1      3        20  (1, 3)
3        3      4       100  (3, 4)
4        3      4       200  (3, 4)
5        3      4       200  (3, 4)
6        4      3       499  (3, 4)

In [143]:
grouped = calls.groupby("id_set")["duration"].sum().reset_index()

In [144]:
grouped["call_count"] = calls.groupby("id_set").count().reset_index()["duration"]

In [145]:
grouped

   id_set  duration  call_count
0  (1, 2)        70           2
1  (1, 3)        20           1
2  (3, 4)       999           4

In [146]:
grouped["person1"] = grouped["id_set"].apply(lambda x: list(x)[0])
grouped["person2"] = grouped["id_set"].apply(lambda x: list(x)[1])

In [147]:
grouped

   id_set  duration  call_count  person1  person2
0  (1, 2)        70           2        1        2
1  (1, 3)        20           1        1        3
2  (3, 4)       999           4        3        4

In [148]:
grouped[["person1", "person2", "call_count", "duration"]]

   person1  person2  call_count  duration
0        1        2           2        70
1        1        3           1        20
2        3        4           4       999